--骰娘语言包在此！
--尽量使用半角标点，因为饥荒的自动换行功能不会识别全角标点。

COC7_DICE_LANG =
{
    _ =
    {
        BONUS_DICE = "奖励骰: ",
        PENALTY_DICE = "惩罚骰: ",

        TI = 
        {
            NAME = { "失忆","假性残疾","暴力倾向","偏执","人际依赖","昏厥","逃避","歇斯底里","恐惧","躁狂", },
            DES =
            {
                "{PRON_PER}发现自己只记得最后身处的安全地点, 却没有任何来到这里的记忆",
                "{PRON_PER}陷入了心理性的失明, 失聪以及躯体缺失感中",
                "{PRON_PER}陷入了六亲不认的暴力行为中, 对周围的敌人与友方进行着无差别的攻击",
                "{PRON_PER}陷入了严重的偏执妄想之中",
                "{PRON_PER}因为一些原因而将其他人误认为了{PRON_POS}重要之人并且努力的会与那个人保持那种关系",
                "{PRON_PER}当场昏倒",
                "{PRON_PER}会用任何的手段试图逃离现在所处的位置",
                "{PRON_PER}表现出大笑, 哭泣, 嘶吼, 害怕等的极端情绪表现",
                "投1D100或者由守秘人选择, 来从恐惧症状表中选择一个恐惧源, 就算这一恐惧的事物是并不存在的",
                "投1D100或者由守秘人选择, 来从躁狂症状表中选择一个躁狂的诱因",
            },
        },

        LI =
        {
            NAME = { "失忆","被窃","遍体鳞伤","暴力倾向","极端信念","重要之人","被收容","逃避","恐惧","躁狂", },
            DES =
            {
                "{PRON_PER}发现自己身处一个陌生的地方, 并忘记了自己是谁。记忆会随时间恢复",
                "{PRON_PER}发觉自己被盗, 身体毫发无损。如果{PRON_PER}携带着宝贵之物, {PRON_PER}应当做幸运检定来决定其是否被盗。所有有价值的东西无需检定自动消失",
                "{PRON_PER}恢复清醒后发现自己身上满是拳痕和瘀伤。生命值减少到疯狂前的一半, 但没有造成重伤",
                "{PRON_PER}陷入强烈的暴力与破坏欲之中。{PRON_PER}回过神来可能会理解自己做了什么也可能毫无印象",
                "{PRON_PER}采取了极端和疯狂的表现手段展示{PRON_POS}思想信念之一",
                "{PRON_PER}不顾一切地尝试了接近重要之人, 并为{PRON_PER}和此人的关系做出行动",
                "{PRON_PER}在精神病院病房或警察局牢房中回过神来, {PRON_PER}可能会慢慢回想起导致自己被关在这里的事情",
                "{PRON_PER}发现自己在很远的地方, 也许迷失在荒郊野岭, 或是在驶向远方的列车或长途汽车上",
                "{PRON_PER}患上一个新的恐惧症。在恐惧症状表上骰1D100来决定症状, 或由守秘人选择一个",
                "{PRON_PER}患上一个新的躁狂症。在躁狂症状表上骰1D100来决定症状, 或由守秘人选择一个",
            },
        },
    },

    DEFAULT =
    {
        --花括号 (例如{EXP}) 是占位符, 我在注释中举了一些例子来解释这些花括号的含义
        R = "进行基础掷骰: {EXP}。",  --进行基础掷骰: 1D6+1D4=7。
        NR = "为{R_NAME}进行基础掷骰: {EXP}。",  --为伤害进行基础掷骰: 1D6+1D4=7。

        RH = "进行暗骰: {EXP}。",  --进行暗骰: 1D100。
        NRH = "为{R_NAME}进行暗骰: {EXP}。",  --为心理学进行暗骰: 1D100。

        RHR = "暗骰结果: {EXP}。",  --暗骰结果: 1D100=45。
        NRHR = "暗骰{R_NAME}的结果: {EXP}。",  --暗骰心理学的结果: 1D100=81

        ST = "已为此玩家设置{ST_AMOUNT}条属性。",  --已为此玩家设置28条属性。
        --/st san60hp15-5str50
        --错误: 第3个项目 "-5" 不符合 st 命令的格式。
        ST_ERROR = "错误: 第{ST_ERR_NUM}个项目 \"{ST_ERR_CODE}\" 不符合 st 命令的格式。",
        ST_SHOW = "此玩家的{ST_NAME}属性为{ST_VALUE}。",  --此玩家的理智为67。
        ST_CLEAR = "已初始化所有属性。",

        --进行侦查检定: 1D100=34/60, 成功。
        --进行斗殴检定: 1D100=79[奖励骰: 0]=9/50, 极难成功。
        RA = "进行检定: {EXP}, {RA_RES}",
        NRA = "进行{RA_NAME}检定: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败。",
            "失败。",
            "成功。",
            "困难成功。",
            "极难成功。",
            "大成功。",
        },

        SC = "进行理智检定 ({SC_VALUE}) : {EXP}, ",  --进行理智检定 (1/1D6) : 1D100=82/60, 失败, 扣除1D6=3点SAN。
        SC_SUCCESS = "成功, 扣除{EXP_2}点SAN。",
        SC_FAIL = "失败, 扣除{EXP_2}点SAN。",

        PRON_PER = "调查员",
        PRON_POS = "他的",
        --疯狂发作-即时症状: 1D10=3, 暴力, 调查员陷入了六亲不认的暴力行为中, 对周围的敌人与友方进行着无差别的攻击。持续1D10=8小时。
        TI = "疯狂发作-即时症状: {EXP}, {INS_NAME}, {INS_DES}。持续{EXP_2}小时。",
        --疯狂发作-总结症状: 1D10=5, 极端信念, 调查员采取了极端和疯狂的表现手段展示调查员的思想信念之一。持续了1D10=3小时。
        LI = "疯狂发作-总结症状: {EXP}, {INS_NAME}, {INS_DES}。持续{EXP_2}小时。",
    },

    --[[向文本传入的参数: 

        {R_NAME}        基础掷骰和暗骰指令的名称

        {EXP},{EXP_2}
            骰子的表达式及结果, 例如1D100=29、1D8+1D4=6等。暗骰不会给出结果
            若掷骰是一次检定, 则会附带一个斜杠和属性值显示为分数形式, 例如: 1D100=17/50
            若有奖励骰或惩罚骰, 则会像这样: 1D100=57 [奖励骰: 2,8] =27/40, 引用_.BONUS_DICE
            {EXP_2}代表另一个掷骰的表达式和结果, 用于需要一次性进行两次掷骰的指令 (如sc和ti) 

        {ST_AMOUNT}     使用/st指令时设定属性的数量
        {ST_ERR_NUM}    /st指令的键值对不合法时, 错误键值对的序号 (即出错的是第几个键值对)
        {ST_ERR_CODE}   /st指令的键值对不合法时, 错误键值对的内容
        {ST_NAME}       属性 (或技能) 名称
        {ST_VALUE}      属性 (或技能) 的数值

        {RA_NAME}       检定名称, 通常是属性或技能的名称
        {RA_RES}        检定结果, 即检定的成功等级

        {SC_VALUE}      理智检定时应当扣除的理智, 例如: 1/1D6; 1D3/1D20

        {INS_NAME}      疯狂发作症状的名称
        {INS_DES}       疯狂发作症状的描述

        向参数中传递的参数: 

        {PRON_PER}     {INS_DES}中角色的自称 (人称代词) , 对应XXX.PRON_PER
        {PRON_POS}     {INS_DES}中角色的自称 (物主代词) , 对应XXX.PRON_PER
    --]]

    --[[角色名称: 

        WILSON          威尔逊
        WILLOW          薇洛
        WOLFGANG        大力士
        WENDY           温蒂
        WX78            机器人
        WICKERBOTTOM    老奶奶
        WOODIE          伍迪
        WES             韦斯
        WAXWELL         老麦
        WIGFRID         女武神
        WEBBER          韦伯
        WINONA          女工
        WARLY           沃利
        WALTER          沃尔特
        WORTOX          恶魔
        WORMWOOD        植物人
        WURT            鱼妹
        WANDA           旺达
    --]]

    WILSON =
    {
        R = "为了科学, 我来掷骰子: {EXP}。",
        NR = "为了与{R_NAME}相关的科学, 我来掷骰子: {EXP}。",

        RH = "我进行了一次秘密实验: {EXP}。",
        NRH = "我为{R_NAME}进行了一次秘密实验: {EXP}。",

        RHR = "我为秘密实验写了份实验报告: {EXP}",
        NRHR = "我为这场隐秘的{R_NAME}实验写了份报告: {EXP}",

        ST = "这{ST_AMOUNT}个数据对我的实验是必不可少的, 我把它们记了下来。",
        ST_ERROR = "第{ST_ERR_NUM}个数据 \"{ST_ERR_CODE}\" 的格式不对, 我不接受这份不可靠的实验报告!",
        ST_SHOW = "根据我的实验, 我的{ST_NAME}是{ST_VALUE}。",
        ST_CLEAR = "我的研究成果全部消失了!",

        RA = "我要研究一下这件事: {EXP}, {RA_RES}",
        NRA = "我认为{RA_NAME}很值得研究: {EXP}, {RA_RES}",
        RA_RES =
        {
            "大失败——哦不, 我的实验引发了爆炸!",
            "失败了——通往真理的道路总是曲折的。",
            "成功, 对一名绅士科学家来说不是什么难事。",
            "困难成功, 我离真理又近了一步!",
            "极难成功, 能获得这种成就, 我真是个天才!",
            "大成功! 我要用我的思想征服这个世界!",
        },

        SC = "我还保持着科学的头脑吗 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "成功——我很清醒, 只扣除了{EXP_2}点SAN。",
        SC_FAIL = "失败——这还算科学吗? 我损失了{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我疯了: 我开始{EXP}, {INS_NAME}了。在接下来的{EXP_2}小时内, {INS_DES}。",
        LI = "我怎么了? 我好像在刚才的{EXP_2}小时内一直受困于{EXP}, {INS_NAME}的症状, 现在{INS_DES}。",
    },

    WILLOW =
    {
        R = "{EXP}, 哼, 掷骰子真无聊。",
        NR = "懒鬼, 你为什么要让我帮你{R_NAME}? {EXP}, 满意了吧!",

        RH = "我悄悄地点起一把火: {EXP}。",
        NRH = "为了{R_NAME}, 我悄悄地点起一把火: {EXP}。",

        RHR = "嘿! 嘿! 这场大火神不知鬼不觉地烧掉了{EXP}座房子!",
        NRHR = "别告诉别人, 我用{R_NAME}烧掉了{EXP}座房子!",

        ST = "这{ST_AMOUNT}个数字是什么? 好吧, 我把它们记下来。",
        ST_ERROR = "这第{ST_ERR_NUM}条, \"{ST_ERR_CODE}\" 那里我看不懂, 快改一下再给我看!",
        ST_SHOW = "我的{ST_NAME}差不多有{ST_VALUE}那么多。",
        ST_CLEAR = "我把所有东西都烧光了!",

        RA = "我要点把火试试: {EXP}, {RA_RES}",
        NRA = "我要试试点燃{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES =
        {
            "大失败, 好冷! 像冰火在燃烧!",
            "失败了, 我真想烧掉这颗愚蠢的骰子!",
            "成功, 呼! 太棒了!",
            "困难成功! 接招, 你们这些该死的家伙!",
            "极难成功! 我要烧点东西庆祝一下!",
            "大成功! 所有的一切终将沐浴在最美的火焰中。",
        },

        SC = "我的眼眶好像在燃烧 ({SC_VALUE}) , {EXP}!",
        SC_SUCCESS = "还好只是错觉, 扣除了{EXP_2}点SAN, 这些衣服都要烧掉!",
        SC_FAIL = "失败! 帮帮我, 伯尼! 那个影子袭击了我, 我损失了{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "烧吧! 我开始{EXP}, {INS_NAME}了, 接下来{EXP_2}个小时之内, {INS_DES}。",
        LI = "我怎么了? 我浪费{EXP_2}个小时{EXP}, {INS_NAME}了, 现在{INS_DES}。你在哪, 伯尼? ",
    },

    WOLFGANG =
    {
        R = "沃尔夫冈掷出小骰子: {EXP}!",
        NR = "沃尔夫冈为了{R_NAME}掷出小骰子: {EXP}。",

        RH = "沃尔夫冈悄悄掷出小骰子: {EXP}。",
        NRH = "沃尔夫冈会为了替{R_NAME}保守秘密而悄悄地掷出小骰子: {EXP}。",

        RHR = "小骰子告诉沃尔夫冈 \"{EXP}\" 。",
        NRHR = "小骰子告诉沃尔夫冈 \"{R_NAME}: {EXP}\" ",

        ST = "沃尔夫冈会记住这{ST_AMOUNT}个数字!",
        ST_ERROR = "沃尔夫冈看不懂这些，尤其是第{ST_ERR_NUM}条 \"{ST_ERR_CODE}\" 那里!",
        ST_SHOW = "沃尔夫冈有{ST_VALUE}那么多的{ST_NAME}。",
        ST_CLEAR = "沃尔夫冈把所有数字都忘光了!",

        RA = "沃尔夫冈努力锻炼肌肉: {EXP}, {RA_RES}",
        NRA = "沃尔夫冈用{RA_NAME}来锻炼肌肉: {EXP}, {RA_RES}",
        RA_RES =
        {
            "大失败。哦不, 沃尔夫冈搞砸了这场演出!",
            "失败, 沃尔夫冈的肌肉还不够强大。",
            "成功, 嗯, 肌肉感觉好多了, 但还可以更强壮些。",
            "困难成功, 沃尔夫冈的状态又回来了!",
            "极难成功, 沃尔夫冈强壮得能举起一节车厢!",
            "大成功, 我是最强壮的! 没有人比我更强壮!",
        },

        SC = "沃尔夫冈神志不清了 ({SC_VALUE}) : {EXP}!",
        SC_SUCCESS = "成功——沃尔夫冈感觉好些了, 但还是失去了{EXP_2}点SAN。",
        SC_FAIL = "失败! 我害怕! 我扣除了{EXP_2}点SAN!",

        PRON_PER = "沃尔夫冈",
        PRON_POS = "他的",
        TI = "沃尔夫冈好害怕: {EXP}, 沃尔夫冈出现了{INS_NAME}, {INS_DES}, 沃尔夫冈会在{EXP_2}小时后恢复正常!",
        LI = "沃尔夫冈都干了什么? {EXP}, 沃尔夫冈{INS_NAME}! {INS_DES}, 已经过了{EXP_2}小时了? ",
    },

    WENDY =
    {
        R = "来投骰子吧, 阿比盖尔! {EXP}。",
        NR = "我不擅长{R_NAME}, 让阿比盖尔来试试? {EXP}。",

        RH = "其他人永远看不到{EXP}的结果, 就像我的人生。",
        NRH = "只有阿比盖尔关心{EXP}的结果, 就像关心我的{R_NAME}一样。",

        RHR = "除了我, 没人在乎{EXP}。",
        NRHR = "阿比盖尔以前很擅长{R_NAME}, 就像{EXP}。",

        ST = "阿比盖尔, 帮我记一下这{ST_AMOUNT}个数字。",
        ST_ERROR = "我的人生中充满了错误，第{ST_ERR_NUM}条的 \"{ST_ERR_CODE}\" 也不例外。",
        ST_SHOW = "我的{ST_NAME}有{ST_VALUE}——大人们总是喜欢数字。",
        ST_CLEAR = "我失去了我所拥有的一切。",

        RA = "生存还是毁灭, 这是个问题。{EXP}, {RA_RES}",
        NRA = "{RA_NAME}还是不{RA_NAME}, 这是个问题。{EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 不……不要再次丢下我!",
            "失败, 小心啊, 阿比盖尔!",
            "成功, 我能感觉到阿比盖尔的气息越来越强了。",
            "困难成功, 阿比盖尔就快到了!",
            "极难成功, 阿比盖尔准备好了, 但她需要一点空间。",
            "大成功, 阿比盖尔? 回来! 我还没和你玩够呢。",
        },

        SC = "我脚下的地面仿佛正在崩溃 ({SC_VALUE}) 。{EXP}, ",
        SC_SUCCESS = "成功。痛苦依旧, 但我早已麻木。只失去了{EXP_2}点SAN。",
        SC_FAIL = "失败。阿比盖尔, 你在哪? 我失去了{EXP_2}点SAN……",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我的意识开始迷离: {EXP}, 我感到了{INS_NAME}。{INS_DES}。阿比盖尔, 请等我{EXP_2}小时。",
        LI = "我经历了最痛苦和恍惚的时间。{EXP}, 我经历了{INS_NAME}, {INS_DES}, 我无意义的人生又失去了{EXP_2}小时的时间。",
    },

    WX78 =
    {
        R = "尝试调用随机模块: {EXP}。",
        NR = "尝试调用随机模块 \"{R_NAME}\" : {EXP}。",

        RH = "以私密权限调用随机模块: {EXP}。",
        NRH = "以私密权限调用随机模块 \"{R_NAME}\" : {EXP}。",

        RHR = "随机模块反馈值: {EXP}。",
        NRHR = "随机模块 \"{R_NAME}\" 反馈值: {EXP}。",

        ST = "已成功扫描{ST_AMOUNT}份生物数据。",
        ST_ERROR = "抛出错误: 不合法的输入 \"{ST_ERR_CODE}\" , 位置: [{ST_ERR_NUM}]。",
        ST_SHOW = "正在自我检查{ST_NAME}: 评估结果{ST_VALUE}。",
        ST_CLEAR = "已格式化所有数据数据。",

        RA = "尝试剔除移情作用模块: {EXP}, 运行结果: {RA_RES}",
        NRA = "尝试采用 \"{RA_NAME}\" 方案剔除移情作用模块: {EXP}, 运行结果: {RA_RES}",
        RA_RES = 
        {
            "\"大失败\" ; 不! 薇诺娜, 不要修复那个模块!",
            "\"失败\" ; 错误, 检测到危险源: 水。",
            "\"成功\" ; 已产生6个芯片接口。",
            "\"困难成功\" ; 系统运转状况良好。",
            "\"极难成功\" ; 电量充足，系统过载。",
            "\"大成功\" ; [移情作用模块未响应。]",
        },

        SC = "检测到CPU受损, 损害等级: {SC_VALUE}, 评估损伤状态: {EXP}, ",
        SC_SUCCESS = "轻度损伤: 损伤精确值 \"SAN - {EXP_2}\" 。",
        SC_FAIL = "重度损伤: CPU过热! 系统故障: 故障码 \"SAN - {EXP_2}\"",

        PRON_PER = "系统",
        PRON_POS = "我的",
        TI = "警告, 系统开始出现故障: {EXP}, 检测到系统出现{INS_NAME}, {INS_DES}。预计修复时长: {EXP_2}小时。",
        LI = "系统重启: {EXP}, 系统已持续了{EXP_2}小时的{INS_NAME}故障, 现象: {INS_DES}。",
    },

    WICKERBOTTOM =
    {
        R = "这是完全符合统计学规律的: {EXP}。",
        NR = "根据统计学规律, {R_NAME}应该会得出: {EXP}。",

        RH = "我得把这份档案 \"{EXP}\" 藏到我的秘密地下室中。",
        NRH = "我得把这份关于{R_NAME}的资料 \"{EXP}\" 藏到我的秘密地下室中。",

        RHR = "我在秘密地下室中发现了这个: {EXP}。",
        NRHR = "我从地下室的{R_NAME}资料中发现了这个: {EXP}。",

        ST = "我把这{ST_AMOUNT}本书整理到了书架上。",
        ST_ERROR = "这怎么行? 第{ST_ERR_NUM}本书 \"{ST_ERR_CODE}\" 不符合杜威十进分类法。",
        ST_SHOW = "图书馆中共收藏了{ST_VALUE}本《{ST_NAME}》。",
        ST_CLEAR = "一场大火烧掉了我所有的藏书!",

        RA = "我很擅长图书管理员的工作: {EXP}, {RA_RES}",
        NRA = "想要当好图书管理员, 就要学会{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 不! 有人放火烧毁了整座图书馆!",
            "失败——我把《垂钓者生存指南》放在哪了?",
            "成功。抱歉, 《应用造林学》已经被借走了。",
            "困难成功, 我替您找到了您要找的《永恒之光》。",
            "极难成功, 《养蜂笔记》、《末日将至》和《触手的呼唤》? 没问题!",
            "大成功。嘘! 别说话!",
        },

        SC = "我收到了禁忌的知识 ({SC_VALUE}) : {EXP}, ",
        SC_SUCCESS = "我稳定住了自己的精神, 失去了{EXP_2}点SAN。",
        SC_FAIL = "我为此付出了代价——我失去了{EXP_2}点SAN。",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我开始出现幻觉了: {EXP}, 我这种状态的学名叫作 \"{INS_NAME}\" , {INS_DES}。哦不, 请等我{EXP_2}个小时……",
        LI = "我刚刚经历了恐怖的幻觉: {EXP}, 学名为 \"{INS_NAME}\" , {INS_DES}。似乎已经过去{EXP_2}小时了。",
    },

    WOODIE =
    {
        R = "露西要砍倒{EXP}棵树!",
        NR = "露西要为了{R_NAME}砍倒{EXP}棵树!",

        RH = "我有一个可怕的秘密: {EXP}。",
        NRH = "我有一个关于{R_NAME}的秘密: {EXP}。",

        RHR = "我的秘密是: {EXP}天之后, 我会变成海狸人!",
        NRHR = "我的秘密是: 从{R_NAME}可以看出, {EXP}天之后我会变成海狸人!",

        ST = "露西在木头上划了{ST_AMOUNT}条划痕作为记号!",
        ST_ERROR = "我不能把这些记录在木头上——第{ST_ERR_NUM}道划痕 \"{ST_ERR_CODE}\" 让木头折断了!",
        ST_SHOW = "根据木头上的划痕, 我和露西有{ST_VALUE}的{ST_NAME}!",
        ST_CLEAR = "我扔掉了那块记事用的木头。",

        RA = "露西要来砍一棵树: {EXP}, {RA_RES}",
        NRA = "进行{RA_NAME}检定: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败! 不好了, 那棵树在袭击我们!",
            "失败, 就连露西也砍不倒这棵大理石树。",
            "成功, 就像一把普通的斧头一样。",
            "困难成功, 露西比纯金的斧头还要更好!",
            "极难成功, 那把铥矿镐斧……啊, 她简直太完美了。",
            "大成功——那是一棵漂亮的树，是吧？漂亮不了多久了。",
        },

        SC = "我好像吃下了怪物肉一样难受 ({SC_VALUE}) : {EXP}, ",
        SC_SUCCESS = "还好, 我只扣除了{EXP_2}点SAN。",
        SC_FAIL = "我受到了诅咒的影响, 扣除了{EXP_2}点SAN!",

        PRON_PER = "我和露西",
        PRON_POS = "我的",
        TI = "不! 我的诅咒开始生效了: {EXP}, 我和露西就像一头鹿一样{INS_NAME}, {INS_DES}! 我和露西得等上{EXP_2}小时才能恢复。",
        LI = "我刚刚变成了一只鹅: {EXP}, 我和露西就像一只落魄的加拿大鹅一样{INS_NAME}, {INS_DES}……在过去的{EXP_2}个小时之内都是这样的。",
    },

    WES =
    {
        R = "{EXP} (挥舞手臂假装自己在掷骰子。)",
        NR = "{EXP} (表演{R_NAME}的默剧。)",

        RH = "{EXP} (弯腰, 手放在嘴边假装在说悄悄话。)",
        NRH = "{EXP} (摆出说悄悄话的动作，作出 \"{R_NAME}\" 的口型。)",

        RHR = "(将 \"{EXP}\" 写在气球上。)",
        NRHR = "(将 \"{R_NAME}\" 和 \"{EXP}\" 写在气球上。)",

        ST = "(吹起{ST_AMOUNT}个气球。)",
        ST_ERROR = "(在第{ST_ERR_NUM}个气球上写上 \"{ST_ERR_CODE}\" , 然后所有气球都爆炸了。)",
        ST_SHOW = "(用{ST_VALUE}个气球扎成了 \"{ST_NAME}\"的字样。)",
        ST_CLEAR = "(打爆了所有气球。)",

        RA = "(尝试表演一出默剧: {EXP}, {RA_RES})",
        NRA = "(表演{RA_NAME}的默剧: {EXP}, {RA_RES})",
        RA_RES = 
        {
            "大失败, 辛苦换来的鲜果可丽饼被一只猴子吃掉了, 尝试晾衣线上走钢丝然后摔了下来。",
            "失败, 被摔倒的服务生扣上了一大碗炖菜。",
            "成功, 帮助流浪狗和它的主人团聚了。",
            "困难成功, 从两只乌鸦手中保护了两只即将破壳而出的小鸟。",
            "极难成功, 吹了一个红色的气球, 帮助洋娃娃回到了小女孩手中。",
            "大成功, 以永远迷失在永恒领域为代价从两只影手中保护了一个陌生人。",  --唯一在大成功时不会说出座右铭的角色
        },

        SC = "(两眼无神、做出{SC_VALUE}的手势 : {EXP}, ",
        SC_SUCCESS = "又作出释然的样子, 比出{EXP_2}点SAN的手势。)",
        SC_FAIL = "又作出痛苦万分的样子, 比出{EXP_2}点SAN的手势。)",

        PRON_PER = "他",
        PRON_POS = "他的",
        TI = "{EXP}(两手捂住脑袋, 做出{INS_NAME}的样子, {INS_DES}。这场 \"默剧演出\" 持续{EXP_2}个小时。)",
        LI = "{EXP}(惊恐地左顾右盼，做出刚刚经历了{INS_NAME}的样子, {INS_DES}。这场 \"默剧演出\" 持续了{EXP_2}个小时。)",
    },

    WAXWELL =
    {
        R = "请让我来掷骰子: {EXP}。",
        NR = "我要为了{R_NAME}而掷骰子: {EXP}。",

        RH = "我的暗影傀儡掷出了其他人看不见的骰子: {EXP}。",
        NRH = "我为了{R_NAME}召唤暗影傀儡掷出其他人看不见的骰子: {EXP}。",

        RHR = "我感到我的暗影傀儡骰出了{EXP}。",
        NRHR = "我能感受到暗影傀儡为{R_NAME}掷的骰子是{EXP}。",

        ST = "我向暗影秘典中写下了{ST_AMOUNT}条笔记。",
        ST_ERROR = "我认为我不能把这些记下来, 因为第{ST_ERR_NUM}条的 \"{ST_ERR_CODE}\" 看起来不正确。",
        ST_SHOW = "暗影秘典中{ST_NAME}对应的数字是{ST_VALUE}。",
        ST_CLEAR = "我擦除了所有笔记。",

        RA = "我召唤了暗影傀儡: {EXP}, {RA_RES}",
        NRA = "我尝试让暗影傀儡帮我{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败。这里只有无尽的虚无、尘埃, 还有它们。",
            "失败, 正如一首讨厌的拉格泰姆音乐。",
            "成功。朋友, 你看起来状态不佳, 你最好在天黑前找点吃的!",
            "困难成功, 我的暗影傀儡将所向披靡。",
            "极难成功, 不要忘记我曾经是世界之王!",
            "大成功。自由适合我!",
        },

        SC = "好熟悉的味道……那是花香吗? ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "扣除{EXP_2}点SAN, 还是要做做样子的……",
        SC_FAIL = "扣除{EXP_2}点SAN。哎哟! 查理, 温柔点!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我好像看到了它们: {EXP}, 我似乎出现了{INS_NAME}, {INS_DES}。这大概会持续{EXP_2}小时。",
        LI = "它们刚才与我交流了: {EXP}, 我经历了{INS_NAME}, {INS_DES}。大约已经过去{EXP_2}小时了。",
    },

    WIGFRID =
    {
        R = "愿诺恩们祝福你: {EXP}!",
        NR = "愿诺恩们、众神和{R_NAME}祝福你: {EXP}。",

        RH = "任何伟大的战士都不应该被发现跟植物说话: {EXP}。",
        NRH = "对于伟大的战士来说, {R_NAME}是可耻的: {EXP}。",

        RHR = "长不长随你, {EXP}。",
        NRHR = "{R_NAME}不是战士应该做的行为: {EXP}。",

        ST = "我记住了{ST_AMOUNT}句唱词!",
        ST_ERROR = "第{ST_ERR_NUM}句唱词有错: \"{ST_ERR_CODE}\" 不是正确的台词!",
        ST_SHOW = "《{ST_NAME}》中共有{ST_VALUE}句唱词。",
        ST_CLEAR = "不! 我忘掉了全部的唱词!",

        RA = "英灵殿在等着你: {EXP}, {RA_RES}",
        NRA = "我和{RA_NAME}会在英灵殿相见: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败! 不, 我将在英灵殿安息!",
            "失败, 众神没有祝福我!",
            "成功, 让激战为我开嗓吧!",
            "困难成功, \"拇指怦怦动, 必有恶人来! \"",
            "极难成功, \"你这个卑鄙小人! 无赖! 我会让你痛尝惨败! \"",
            "大成功。世界都是舞台， 属于我的舞台！",
        },

        SC = "我仿佛看到了恶灵 ({SC_VALUE}) : {EXP}, ",
        SC_SUCCESS = "接招, 尝尝我长矛的厉害! 扣除{EXP_2}点SAN!",
        SC_FAIL = "不! 那个影子击败了我, 扣除{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我被恶魔附身了: {EXP}, 它们使我{INS_NAME}, {INS_DES}。我将用{EXP_2}小时与它们斗争!",
        LI = "刚刚有个恶魔附在了我身上: {EXP}, 我似乎{INS_NAME}, {INS_DES}。我用了{EXP_2}小时才将它们赶走!",
    },

    WEBBER =
    {
        R = "我们来掷骰子: {EXP}。",
        NR = "我们为了{R_NAME}掷出骰子: {EXP}。",

        RH = "我们悄悄地来掷骰: {EXP}。",
        NRH = "{R_NAME}是我们的秘密: {EXP}。",

        RHR = "这件事情只有我们知道: {EXP}。",
        NRHR = "只有我们知道{R_NAME}的秘密: {EXP}。",

        ST = "我们会记住这{ST_AMOUNT}个数字的!",
        ST_ERROR = "请问第{ST_ERR_NUM}组数字 \"{ST_ERR_CODE}\" 是什么意思?",
        ST_SHOW = "我们记得 \"{ST_NAME}\" 对应的数字是{ST_VALUE}!",
        ST_CLEAR = "啊哦，我们把所有数字都忘掉了。",

        RA = "我们遇到了麻烦: {EXP}, {RA_RES}",
        NRA = "我们遇到了{RA_NAME}的麻烦: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 不! 我, 我记得那时候它扑向了我……",
            "失败, 我们还需要更加团结。",
            "成功, 耶! 我们成功了!",
            "困难成功, 薇克巴顿女士教导我们要团结一致。",
            "极难成功, 只要我们团结起来就可以克服任何困难。",
            "大成功! 我们总是在一起, 永远不孤单!",
        },

        SC = "我们怎么了 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "我们来到天堂了吗? 我们失去了{EXP_2}点SAN。",
        SC_FAIL = "我们来到地狱了吗? 我们失去了{EXP_2}点SAN……",

        PRON_PER = "我们",
        PRON_POS = "我们的",
        TI = "我们好难受: {EXP}, 我们{INS_NAME}了, {INS_DES}, 或许要等上{EXP_2}小时才会好一些……",
        LI = "刚才真的好难受: {EXP}, 我们刚刚经历了{INS_NAME}, {INS_DES}, 好像已经过了整整{EXP_2}个小时!",
    },

    WINONA =
    {
        R = "掷骰? 我会轻易完成这项工作: {EXP}。",
        NR = "我会出色地完成{R_NAME}的工作: {EXP}。",

        RH = "为了工作, 我会保守{EXP}的秘密。",
        NRH = "为了{R_NAME}的工作, 我会保守{EXP}的秘密。",

        RHR = "只有我掌握{EXP}的技术。",
        NRHR = "只有我掌握着{R_NAME}所必须的技术: {EXP}。",

        ST = "如果我完成这{ST_AMOUNT}项工作, 会给我涨工资吗?",
        ST_ERROR = "你的工作出错了: 第{ST_ERR_NUM}条, \"{ST_ERR_CODE}\" 是不可能做得到的。",
        ST_SHOW = "我如约完成了{ST_NAME}的工作，请给我的年终奖加上{ST_VALUE}。",
        ST_CLEAR = "现在我跟一个新工人差不多了!",

        RA = "我要修复它: {EXP}, {RA_RES}",
        NRA = "我要试着修复{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 哦不, 我想我搞砸了……老板, 你不会把这件事放在心上的对吧?",
            "失败, 即便是我也修不好它。",
            "成功, 我想我可以修好这个。",
            "困难成功, 多亏了我可靠的胶布。",
            "极难成功, 小事一桩!",
            "大成功, 勤劳的双手和辛勤的工作可以修复一切。",
        },

        SC = "查——查理 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "哈! 我知道你的所有招数! 扣除{EXP_2}点SAN。",
        SC_FAIL = "唷! 太没礼貌了! 扣除{EXP_2}点SAN。",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "{EXP}, 我可能必须要为{INS_NAME}请{EXP_2}个小时的假了, {INS_DES}。",
        LI = "{EXP}, 我为{INS_NAME}而请了{EXP_2}个小时的假, 到头来, {INS_DES}。",
    },

    WARLY =
    {
        R = "我会做出{EXP}道美食!",
        NR = "我会像{R_NAME}一样做出{EXP}道美食!",

        RH = "只有我知道怎么烹饪{EXP}!",
        NRH = "只有我知道怎么用{R_NAME}烹饪出{EXP}!",

        RHR = "这是我的秘制香料: {EXP}。",
        NRHR = "我从来没把{R_NAME}的香料工艺告诉过任何人: {EXP}。",

        ST = "我学会了{ST_AMOUNT}种新的食谱。",
        ST_ERROR = "不, 不, 按照这份食谱中的第{ST_ERR_NUM}条 \"{ST_ERR_CODE}\" 烹饪的话, 会得到味道十分可怕的菜品!",
        ST_SHOW = "我在食谱上写着{ST_NAME}是{ST_VALUE}。",
        ST_CLEAR = "我已经忘掉了所有的食谱!",

        RA = "我随便炖了一锅菜: {EXP}, {RA_RES}",
        NRA = "我炖了一锅{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 这比恐怖国王饼还要难吃!",
            "失败, 我只做出了一锅湿腻焦糊。",
            "成功, 我炖了一锅骨头汤。",
            "困难成功, 我炖了一锅海鲜杂烩, 很美味!",
            "极难成功, 我做出了一盘伏特羊肉冻!",
            "大成功, 我……为我的母亲……做了一碗贻贝汤……",  --唯二的大成功时不会说出座右铭的角色
        },

        SC = "我看到了……妈妈? 是你吗 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "只是一个幻觉而已……我失去了{EXP_2}点SAN。",
        SC_FAIL = "不, 妈妈! 不要离开我! 我失去了{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我恐怕会做出非常难吃的菜品, 这是因为{EXP}, 我患上{INS_NAME}了, {INS_DES}。等一等，新菜还有{EXP_2}个小时才能出锅!",
        LI = "我的炖菜烧糊了! 因为我刚刚{EXP}, {INS_NAME}了, {INS_DES}, 这锅菜炖了整整{EXP_2}个小时!",
    },

    WALTER =
    {
        R = "投骰子，我最喜欢的活动! {EXP}。",
        NR = "我的{R_NAME}会是多少呢? {EXP}。",

        RH = "我来跟沃比说一句悄悄话: {EXP}。",
        NRH = "我来说句关于{R_NAME}的悄悄话: {EXP}。",

        RHR = "我悄悄告诉沃比: {EXP}。",
        NRHR = "只有我一个人知道{R_NAME}和{EXP}!",

        ST = "我记住这{ST_AMOUNT}个数字了!",
        ST_ERROR = "第{ST_ERR_NUM}个数字那里有错, 就是 \"{ST_ERR_CODE}\" 那里写错了!",
        ST_SHOW = "我有{ST_VALUE}那么多的{ST_NAME}!",
        ST_CLEAR = "啊哦, 我把所有数字都忘光了。",

        RA = "松树先锋队队员执行任务: {EXP}, {RA_RES}",
        NRA = "松鼠先锋队队员听从{RA_NAME}的号令: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 不! 我受伤了! 我需要急救! 快, 急救箱在哪?",
            "失败, 这做起来要比手册上难得多啊……",
            "成功, 我来讲一个篝火故事吧!",
            "困难成功, 我掌握窍门了!",
            "极难成功, 这值得一枚奖章!",
            "大成功, 松树先锋队员时刻准备着!",
        },

        SC = "你好, 黑影先生 ({SC_VALUE}) ! {EXP}, ",
        SC_SUCCESS = "你好吗? 我们来做朋友吧! 扣除{EXP_2}点SAN。",
        SC_FAIL = "嘿, 等等——我还以为我们能做朋友呢! 扣除{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我怎么了? {EXP}, 我好像{INS_NAME}了, {INS_DES}, 我要花上{EXP_2}小时……",
        LI = "我刚刚怎么了? {EXP}, 我刚刚{INS_NAME}了, {INS_DES}, 花掉了我{EXP_2}小时的时间。",
    },

    WORTOX =
    {
        R = "掷骰子好玩吗? {EXP}。",
        NR = "想玩{R_NAME}, 就得掷骰子: {EXP}, 哼!",

        RH = "我拿走了这颗骰子的灵魂: {EXP}。",
        NRH = "我在{R_NAME}时带走了这颗骰子的灵魂: {EXP}。",

        RHR = "这个灵魂似乎是{EXP}。",
        NRHR = "这颗来自{R_NAME}的灵魂似乎是{EXP}。",

        ST = "我收集了{ST_AMOUNT}颗灵魂!",
        ST_ERROR = "我不能带走第{ST_ERR_NUM}颗灵魂 \"{ST_ERR_CODE}\" ——这太贪婪了。",
        ST_SHOW = "来自{ST_NAME}的灵魂写着 \"{ST_VALUE}\"。",
        ST_CLEAR = "我释放了所有灵魂!",

        RA = "我要玩一场恶作剧: {EXP}, {RA_RES}",
        NRA = "我要用{RA_NAME}来玩一场恶作剧: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败! 快住手, 坎普斯! 停手!",
            "失败, 哼, 我这手是真的被诅咒了。",
            "成功, 灵魂够多了, 可以生存下去了。",
            "困难成功, 这不算太贪婪吧。",
            "极难成功, 小猪, 来跳支舞吧!",
            "大成功。原谅我, 我不能握手。",
        },

        SC = "我来到地狱了吗 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "呼, 我逃出来了! 扣除了{EXP_2}点SAN。",
        SC_FAIL = "该死! 我在地狱里被偷走了{EXP_2}点SAN!",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "我意外唤醒了我的力量: {EXP}, 我会变得{INS_NAME}, {INS_DES}。大概会持续{EXP_2}小时, 原谅我, 我没有恶意。",
        LI = "我遭到天谴了: {EXP}, 我经历了{INS_NAME}, {INS_DES}。持续了{EXP_2}个小时!",
    },

    WORMWOOD =
    {
        R = "{EXP}的朋友。",
        NR = "和朋友{R_NAME}: {EXP}。",

        RH = "悄悄地{EXP}。",
        NRH = "悄悄地{R_NAME}: {EXP}。",

        RHR = "只告诉朋友: {EXP}。",
        NRHR = "只告诉{R_NAME}朋友: {EXP}。",

        ST = "认识了{ST_AMOUNT}个新朋友。",
        ST_ERROR = "朋友{ST_ERR_NUM}病了: \"{ST_ERR_CODE}\" 。",
        ST_SHOW = "{ST_NAME}朋友是{ST_VALUE}。",
        ST_CLEAR = "没朋友了。",

        RA = "交朋友: {EXP}, {RA_RES}",
        NRA = "和朋友{RA_NAME}: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败。抱歉, 朋友。",
            "失败。不想伤害朋友。",
            "成功。是朋友。",
            "困难成功。生长吧!",
            "极难成功。和其他植物说话真开心!",
            "大成功。你好, 朋友。",
        },

        SC = "朋友怎么了 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "朋友还好, SAN变少了{EXP_2}。",
        SC_FAIL = "朋友病了, SAN变少了{EXP_2}。",

        PRON_PER = "",
        PRON_POS = "",
        TI = "病了: {EXP}, {INS_NAME}了, {INS_DES}。要等{EXP_2}小时。",
        LI = "病了: {EXP}, 刚刚{INS_NAME}, {INS_DES}。过了{EXP_2}小时。",
    },

    WURT =
    {
        R = "投骰子{EXP}, 浮浪噗。",
        NR = "{R_NAME}的骰子是{EXP}, 浮浪噗。",

        RH = "悄悄地投{EXP}, 浮浪噗。",
        NRH = "悄悄地{R_NAME}, {EXP}, 浮浪噗。",

        RHR = "不告诉别人{EXP}, 格浪噗。",
        NRHR = "不告诉别人{R_NAME}是{EXP}, 格浪噗。",

        ST = "记住了{ST_AMOUNT}个数字, 浮勒噗。",
        ST_ERROR = "第{ST_ERR_NUM}个 \"{ST_ERR_CODE}\" 太干了, 格勒噗。",
        ST_SHOW = "我有{ST_VALUE}个{ST_NAME}。",
        ST_CLEAR = "全忘记了, 格勒噗。",

        RA = "想看这本书! {EXP}, {RA_RES}",
        NRA = "想看《{RA_NAME}》!: {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败, 不——不然换本简单点的书……",
            "失败, 好多生僻词……",
            "成功, 衡量……夜……热——能的单位……",
            "困难成功, 这是本好书!",
            "极难成功, 能给雨下命令? 想试想试!",
            "大成功, 谁都知道鱼人好客, 浮浪噗。",
        },

        SC = "那是什么 ({SC_VALUE}) ? {EXP}, ",
        SC_SUCCESS = "不怕你, 浮勒噗! 扣除{EXP_2}点SAN。",
        SC_FAIL = "好吓人, 格勒噗! 扣除{EXP_2}点SAN。",

        PRON_PER = "",
        PRON_POS = "",
        TI = "格浪噗, 好难受: {EXP}, 开始{INS_NAME}了, {INS_DES}, 要等{EXP_2}小时, 格勒噗。",
        LI = "格浪噗, 怎么了? {EXP}, 刚才{INS_NAME}了, {INS_DES}。已经过了{EXP_2}小时了, 格浪噗。",
    },

    WANDA =
    {
        R = "不, 这会浪费我{EXP}分钟的!",
        NR = "呃……能快点{R_NAME}吗? 我还有急事……{EXP}。",

        RH = "呃……我下次再告诉你们{EXP}。",
        NRH = "呃……下次再说{R_NAME}和{EXP}的事情吧。",

        RHR = "嗷, 麻烦呐! 这条时间线上的人都不知道{EXP}。",
        NRHR = "嗷, 麻烦呐! 我现在不能说{R_NAME}是{EXP}。",

        ST = "我现在就记住这{ST_AMOUNT}个数字!",
        ST_ERROR = "嗷, 麻烦呐, 我得花上好久才能修好第{ST_ERR_NUM}块怀表 \"{ST_ERR_CODE}\" 。",
        ST_SHOW = "我想我上次提到{ST_NAME}时大约是{ST_VALUE}岁……",
        ST_CLEAR = "这条时间线被重置了!",

        RA = "我只是需要更多时间! {EXP}, {RA_RES}",
        NRA = "我需要时间来{RA_NAME}, {EXP}, {RA_RES}",
        RA_RES = 
        {
            "大失败! 我已经没有多少时间了!",
            "失败! 快点, 快点……",
            "成功! 没关系, 我还有时间……",
            "困难成功! 死神永远也抓不到我!",
            "极难成功! 啊哈! 再次充满了青春的活力!",
            "大成功! 时间! 我只需要更多时间!",
        },

        SC = "不! 我不会让黑暗带走我 ({SC_VALUE}) !! {EXP}, ",
        SC_SUCCESS = "他们找到我了……不——不! 走开! 我失去了{EXP_2}点SAN!",
        SC_FAIL = "哎呦……嗷, 麻烦呐, 我损失了{EXP_2}点SAN。",

        PRON_PER = "我",
        PRON_POS = "我的",
        TI = "不, 他……他们找到我了! {EXP}, 我{INS_NAME}了, {INS_DES}! 不, 我会白白浪费{EXP_2}个小时的时间!",
        LI = "他们差点就追上我了: {EXP}, 我{INS_NAME}了, {INS_DES}。但我为此白白损失掉了整整{EXP_2}个小时的时间!",
    },
}

RULE_INFO = 
{
    COC7 =
    {
        _ = "- 规则: COC7 / 克苏鲁的呼唤第7版\n- 房规: {COC_SUB_RULE}\n- 语言: 中文",
        COC_SUB_RULE =
        {
            "0 (符合COC7规则书, 出1大成功, 不满50出96-100大失败, 满50出100大失败)",
            "1",
            "2",
            "3 (出1-5大成功, 出96-100大失败)",
            "4",
            "5",
        },
    },

    NONE =
    {
        _ = "- 规则: 无（仅包含基础掷骰和暗骰功能）\n- 语言: 中文",
    },
}

DICE_HELP_LANG =
{
    _HELP = [[
[TRPG掷骰增强 (TRPG Dice +) ]
输入 /dicehelp 来获取帮助。
输入 /dicehelp <指令名> 获得更详细的帮助 (例: /dicehelp rh)。\n]],

    COC7 =
    {
        _ = [[
/r : 基础掷骰
/rh : 暗骰
/st : 设置、更改或查看角色属性
/ra : 检定
/sc : 理智检定
/ti : 疯狂发作-即时症状
/li : 疯狂发作-总结症状
/rule : 查看房规]],

        ST = [[
/st <表达式>
设置或更改角色的属性。
表达式应当遵循 \"<属性名><属性值><属性名2><属性值2>……\" 的格式。
属性值可以是数字（设置属性），也可以是带符号的数字（更改属性），例：
- /st 力量60体质50体型55san-2hp+1
--------------------------------
/st show <属性名>
获取一个或全部属性的当前值。
属性名是可选的，留空则会列出所有与默认值不同的属性，例：
- /st show
- /st show 图书馆
- /st show 魔法值
--------------------------------
/st clear
/st init
初始化所有属性。]],

        RA = [[
/ra <属性名> <数值> <奖惩骰>
/ra <数值> <属性名> <奖惩骰>
进行一次检定。
三个参数都是可选的。
奖惩骰的格式为b (奖励骰) 或p (惩罚骰) 加个数。例：
- /ra 图书馆使用
- /ra 邪教徒斗殴 50
- /ra 60 b2
- /ra 驾驶 P1
- /ra npc话术 60 B1]],

        SC = [[
/sc <成功值>/<失败值>
进行一次理智检定并扣除理智值。
理智值自动减少，无需额外使用 /st 指令扣除理智值。例：
- /sc 0/1d6
- /sc 1D3+1/2D10]],

        INS = [[
/ti
抽取一个疯狂发作即时症状并给出持续时间。
--------------------------------
/li
与 /ti 类似，但抽取的是总结症状。]],
    },

    NONE =
    {
        _ = [[
/r : 基础掷骰
/rh : 暗骰
/rule : 查看房规]],

        R = [[
/r <原因> <表达式>
/r <表达式> <原因>
投掷一组骰子 (默认为一个百分骰)。
两个参数都是可选的，例:
- /r
- /r 1D6
- /r 2D (此处2D代表2D100)
- /r 侦查
- /r 伤害 D8+1d4+1
- /r (2d6+6)*5 体型]],

        RH = [[
/rh <原因> <表达式>
/rh <表达式> <原因>
投掷一组只有自己能看见结果的骰子 (默认为一个百分骰)。
该指令的格式与 /r 类似，例:
- /rh
- /rh 2D
- /rh 心理学
- /rh 伤害 D8+1d4+1
- /rh (2d6+6)*5 体型]],

        RULE = [[
/rule
查看房规。
该命令会列出当前 TRPG掷骰增强 mod 的一些配置信息，如规则种类、COC房规等。]],
    },
}
